app/controllers/hacks_controller.rb

SELECT "hacks".* FROM "hacks"
---
  def index
    @hacks = Hack.all